"Close" = "Aizvērt";

"Scan Card" = "Skenēt karti";

"Scan card" = "Skenēt karti";

"The IBAN you entered is invalid." = "Ievadītais IBAN nav derīgs.";

"There was an error processing your card -- try again in a few seconds" = "Radās kļūda, apstrādājot jūsu karti — mēģiniet vēlreiz pēc dažām sekundēm";

"There was an unexpected error -- try again in a few seconds" = "Radusies negaidīta kļūda — mēģiniet vēlreiz pēc dažām sekundēm";

"Try again" = "Mēģināt vēlreiz";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Mēs izmantojam Stripe, lai verificētu jūsu kartes informāciju. Stripe var izmantot un uzglabāt jūsu datus saskaņā ar konfidencialitātes politiku. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Uzzināt vairāk</u></a>";

"Your card has expired" = "Kartes derīguma termiņš ir beidzies";

"Your card was declined" = "Karte tika noraidīta";

"Your card's expiration month is invalid" = "Kartes derīguma termiņa mēnesis nav derīgs";

"Your card's expiration year is invalid" = "Kartes derīguma termiņa gads nav derīgs";

"Your card's number is invalid" = "Kartes numurs nav derīgs";

"Your card's security code is invalid" = "Kartes drošības kods nav derīgs";

"Your name is invalid." = "Jūsu vārds nav derīgs.";

"Your payment method was declined." = "Maksājuma veids tika noraidīts.";
